import { EternalCircleProgress } from "app/models/EternalCircleStatus";
import { Effects } from "../../models/GameScenario";

interface Narrator {
  avatar: string
  name: string
  display?: string
}

interface Dialog {
  bgImg: string
  texts: [string, string][]
  effect?: { pos: number, kind: Effects }[]
}

interface Scenario {
  title: number
  dialogs: Dialog[]
  narrators: Narrator[]
  next?: Choice[]
  prev?: number
}

interface Choice {
  text: string
  result: number
}

const Prologue: Scenario = {
  title: EternalCircleProgress.Prologue,
  narrators: [{
      avatar: "/assets/eternal-circle/chara/L娘.png",
      name: "L娘"
    }, {
      avatar: "/assets/eternal-circle/chara/人间入间.png",
      name: "人间入间"
    }, {
      avatar: "/assets/eternal-circle/chara/F酱.jpg",
      name: "F学姐"
    }, {
      avatar: "/assets/eternal-circle/chara/漫游火焰.jpg",
      name: "漫游火焰"
    }, {
      avatar: "/assets/eternal-circle/chara/桃子淫.jpg",
      name: "桃子淫"
    }, {
      avatar: "/assets/eternal-circle/chara/克蕾儿酱.jpg",
      name: "克蕾儿"
    }, {
      avatar: "/assets/eternal-circle/chara/真诗君.png",
      name: "真诗君"
    }, {
      avatar: "/assets/eternal-circle/spark.gif",
      name: "spark"
    },
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", "本篇中的登场人物均为虚构，CG皆取自网络。出现人物与剧情CG中的显示不符的情况，请当成就是这样设计的。"],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["", "阳光明媚的午后。<br>今天的绅士之庭也很和平。"],
        ["", "人间在锻炼肌肉，L娘在边加班边瞟几眼稿子，F酱在打盹，Duo在地下室调教着站娘和服务器娘，桃子淫在榨汁，火焰在燃烧。<br>绅士之庭相比前两年有了一些人员变动，不过和平的氛围还是保留了下来。"],
        ["", "L娘啜饮了一口普通的红茶，发出了猛男的“呼喵”声。"],
        ["L娘", "“真是和平啊。。。”"],
        ["人间入间", "“什么？”人间椅子说话了。“需要放平一些么！”"],
        ["L娘", "“没有，保持这样就好。”"],
        ["人间入间", "“好的！”人间椅子弓得更圆了。"],
        ["F学姐", "“嘿嘿。。。扶她~♂”F学姐说着一些充满了哲学气息的梦话。"],
        ["漫游火焰", "“。。。”火焰抱着皮套和特摄蓝光碟无声的燃烧着。"],
        ["桃子淫", "“克。。。克蕾儿酱。。。已经够了吧。。。我已经。。。”桃子淫在沙发上被克蕾儿酱无情的榨着汁。"],
        ["克蕾儿", "“不~行~不把你榨干的话又会去外面找小女孩了吧~你的精液全都是我的，是我的❤”"],
        ["", "过了一会，桃子没有声音了。"],
        ["L娘", "（呜哇，好猛。。。）<br>为了掩盖慌乱，L娘又啜饮了一口普通的红茶，发出了猛男的“呼喵”声。"],
        ["L娘", "“真是和平啊。。。”"],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/管理室-扭曲.jpg",
      texts: [
        ["", "。。。<br>。。。"],
        ["", "不，这个景象绝不和平。新人管理员 - 真诗君在房间中默默注视着这一切。<br>虽然都是些司空见惯的景象，但是绝不和平。要问为什么的话。。。"],
        ["", "这个场景已经如同漫无止境的八月一般，在我眼前重复了超过一万次。而时间还是日期都未曾变动过。不论做什么，一切都会从头开始，然后周而复始。"],
      ]
    }, {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["L娘", "“真诗君？你脸色很差哦？发生什么了么？”"],
        ["真诗君", "“啊。。。没有。。。”"],
        ["L娘", "“是么，有事的话要跟我们说哦。”"],
        ["真诗君", "“好的。。。”"],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", "这不绝的轮回，一定是因今次绅士之庭六周年而产生的新的异变。我找到了能解决这场异变的钥匙。<strong>造成异变的原因，就在我所在的绅士之庭管理室之中。</strong>只要能找出产生这轮回的根源，就能拯救我们大家。"],
        ["", "但是我也身陷在这轮回中无法自拔，因此，我决定将这份通往解决异变道路的钥匙交予正在看这份手记的你。请你终结这无限的轮回，让我们再次向未来迈步吧。"],
        ["", "——真诗君"],
        ["", "阅读了这篇手记的你虽然没有获得任何力量，但是却感觉充满了决心。手中的钥匙开始发光，你被它带往了新的世界。撒，让命运之轮开始转动吧。"],
        ["", "能够终结这命运轮回的人，是你么？<br>是你么？<br>还是说。。。是你？"],
      ],
      effect: [{pos:2, kind: Effects.SPARK}]
    }
  ],
  next: [{ text: "", result: EternalCircleProgress.Act1Start}]
}

const ACT1Pre: Scenario = {
  title: EternalCircleProgress.Act1Start,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/nazoshinshi.jpg",
      name: "“主人”"
    }, {
      avatar: "/assets/eternal-circle/chara/人间.png",
      name: "人间入间"
    },
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", "第1章 土地"],
        ["", `我喜欢圆。它代表着许多。<br>
它可以是一无所有的零，可以是包容一切的环，它可以是画上终结的句点，可以是循环往复的轮回。它是一切，又一切都不是。就让我们的故事，就从这个圆环的接缝处开始吧。`],
        ["", `我从出生时起就是独自一人。<br>
父母在生下我后不久就不幸车祸去世，之后，还没断奶的我被送到了几乎没有什么血缘关系的一个亲戚处抚养。——而且连这也是我从别人那里听说来的，大家都说我是天煞孤星，克死了自己的至亲之人。`],
      ],
      effect: [{pos:0, kind:Effects.TITLE}],
    },
    {
      bgImg: "/assets/eternal-circle/早上.jpg",
      texts: [
        ["", `早上，从只有被褥的储物间醒来。`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/早餐.jpg",
      texts: [
        ["", `早餐，是没什么米的稀饭，但是这并不是免费的，我将它全部喝下了。`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/上午.jpg",
      texts: [
        ["", `上午，在远离学校和住所的山林看着天上飘过的云发呆。`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/河边.jpg",
      texts: [
        ["", `中午，在河水中冲洗一下身体，捕捞一些河鲜，熟练的生火，补充当天需要的蛋白质和脂肪。`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/河边-下午.jpg",
      texts: [
        ["", `下午，用挑选出的比较好的货色换些零钱，顺便让隔壁的农民老伯载我回到住所附近。`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/晚餐.jpg",
      texts: [
        ["", `晚上，交够今天份住所的 住宿费 和 餐费 后进入了屋门，从剩下的晚餐挑一些不起眼的食材，接一些水和着锅底的剩米一起下肚。`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/夜里.jpg",
      texts: [
        ["", `"夜里，趁着没人的时候偷偷的洗漱一下，然后将剩下的几毛钱藏在被褥中。<br>虫豸般的生活，自我记事起便如此周而复始。"`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/早餐.jpg",
      texts: [
        ["", `某日的早上，住处的“主人”很偶然的也在用餐。他看着我，想要说什么的样子。`],
        ["人间入间", `“我吃饱了。”`],
        ["", `我将碗筷洗好，准备出门的时候。`],
        ["“主人”", `“等等。”`],
        ["", `“主人”他叫住了我。`],
        ["“主人”", `“听说，你很久都没有去过学校了，是么？”`],
        ["人间入间", `“是的。”`],
        ["“主人”", `“原因我就不问了，从今天开始，你还是普通的去学校吧。至少小学也要毕业啊。”`],
        ["人间入间", `“我知道了。”`],
        ["", `长期不去上学的情况暴露了，接下来你要选择的方向是：`],
      ]
    },
  ],
  next: [
    {
      text: "学习是不可能学习的，只能继续找点河鲜勉强维持生活这样子。",
      result: EternalCircleProgress.Act1After
    },
    {
      text: "知识能改变命运，我应该发奋努力，认真学习，以优秀的成绩毕业。",
      result: EternalCircleProgress.BE1
    }
  ]
}

const BE1: Scenario = {
  title: EternalCircleProgress.BE1,
  narrators: [],
  dialogs: [{
    bgImg: "/assets/eternal-circle/学校-1.png",
    texts: [
      ["", `一边忍受着欺凌，一边努力学习的你，终于在小学毕业前死掉了。死因是被殴打导致的颅内出血，失去意识前你还想着习题没有做完。`],
      ["", `“本来是开玩笑的，结果他随随便便的就死掉了。”涉事学生如此说到，由于监护人表示不再追究，你的死亡作为一次不幸的意外处理了。`],
      ["", `你的死没有任何人感到悲伤，但是让少数人收获了快乐，从结果而言，你为这个世界带来了一些精神上的愉悦，为社会做出了贡献。真是可喜可贺，可喜可贺。`],
    ],
  }],
  prev: EternalCircleProgress.Act1Start,
}

const ACT1After: Scenario = {
  title: EternalCircleProgress.Act1After,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/？？？.png",
      name: "？？？"
    }, {
      avatar: "/assets/eternal-circle/chara/？？？.png",
      name: "豆丁女"
    }, {
      avatar: "/assets/eternal-circle/chara/人间.png",
      name: "人间入间"
    },
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/学校-1.png",
      texts: [
        ["", `那里根本就不是能够好好学习的地方。一共只有1个老师1个校长的“学校”，全年级加起来学生也不到10个人。其中5个人已经留级了一年，还有2个已经留级了两年还没毕业。不是成绩不够好，而是他们享受欺凌其他的低年级生。`]
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `在那暗无天日的时光中，我苦苦寻找着我活着的意义。终于在那时，有一缕光明照耀到了我。`]
      ],
    },
    {
      bgImg: "/assets/eternal-circle/河边.jpg",
      texts: [
        ["", `12岁的午后。<br>当我来到了那曾只属于我的一方净土时，那里却站立着我未曾见过的身影。`],
        ["？？？", `“没见过的家伙哪。”`],
        ["", `那身影先开了口。`],
        ["？？？", ` “你是新来的？给我记好了，从今天起这个地方是属于我L大人的了。”`],
        ["", `这个超拽的家伙是什么情况啊。`],
        ["人间入间", `“。。。我才是先来的。”`],
        ["？？？", `“哈？！你说什么？”`],
        ["人间入间", `“我说。。。”`],
        ["？？？", `“你在说什么啦根本听不清嘛！你没有吃饭啊！亏你还是个男孩子呢！”`],
        ["人间入间", `“我。。。”`],
        ["", `她凑近过来。`],
        ["？？？", `“呜哇！好臭！你这家伙多久没洗澡啦！”`],
        ["人间入间", `“。。。吵死了。”`],
        ["？？？", `“啥？”`],
        ["人间入间", `“吵死了你这豆丁女！”`],
        ["", `那大概是我有生以来第一次敢那么大声讲话。`],
        ["豆丁女", `“哈啊？！！！”`],
        ["", `夏日的阳光下，两个幼小的身影扭打在一起。`],
        ["", `十几分钟后。`],
        ["人间入间", `“哈啊。。。哈啊。。。”`],
        ["", `我跨坐在豆丁女身上，双手紧紧揪住她的衣领。`],
        ["豆丁女", `“哈啊。。。哈啊。。。”`],
        ["", `比没吃过什么正经饭菜的我还要没力气，哪怕是和班上的那些最柔弱的女孩子们比起来，也绝对要更弱——体能测试时我有些项目还不如那些女孩子呢。`],
        ["豆丁女", `“你这禽兽。。。想对我。。。这样。。。性感的身体。。。为所欲为。。。对吧。”`],
      ],
    },
  ],
  next: [
    {
      text: "是的。我想要知道女人的滋味。",
      result: EternalCircleProgress.BE2
    },
    {
      text: "嘲笑她。钢板锉刀不是我的菜。",
      result: EternalCircleProgress.ACT1End
    }
  ]
}

const BE2: Scenario = {
  title: EternalCircleProgress.BE2,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/？？？.png",
      name: "豆丁女"
    },
    {
      avatar: "/assets/eternal-circle/chara/豆丁女_哭泣.png",
      name: "豆丁女_哭泣",
      display: "豆丁女",
    }, {
      avatar: "/assets/eternal-circle/chara/人间.png",
      name: "人间入间"
    }, {
      avatar: "/assets/eternal-circle/chara/塞巴斯.png",
      name: "塞巴斯"
    },
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/BE2_1.jpg",
      texts: [
        ["", `我无言将手伸向了豆丁女的下体。`],
        ["豆丁女", `“喂。。。等！你这家伙不会真的！”`],
        ["", `豆丁女感觉到了危险，拼尽最后一点力量抵抗着。然而这份绝对的力量差距，注定了这一切都是徒劳。
高级布料做成的白色内裤被拨到了一边，露出了洁白而美丽的幼穴。
本来也不期待能够和什么异性交往或者结婚什么的了，这一瞬间，可能就是我这样狗屎一样的人生第一次也是最后一次的机会了。
我脱下了裤子，压在豆丁女身上。
`],
        ["豆丁女", `“快点。。。住手。。。我道歉。。。我道歉！不要。。。这样。。”`],
        ["", `刚刚还很强势的豆丁女，现在竟然露出恐惧的表情哭着道歉。然而她哭泣着的脸却令我更加的兴奋了。`],
        ["", `虽然只有一次从门缝里瞥见主人和家里那个同龄的孩子做这个，应该是这样做吧。。。被生殖的本能驱使着，我把我的宝贝顶在豆丁女光洁的下体上摩擦。`],
        ["豆丁女_哭泣", `“呜。。。噫咕。。。”`],
        ["", `豆丁女紧紧闭上双眼，仿佛要逃离现实一般。`],
        ["人间入间", `“啊嘞。。。进不去啊。。。”`],
        ["", `好不容易才把鸡鸡塞进去缝缝里，鸡鸡被勒的紧紧的，几乎无法动一毫米。`],
        ["豆丁女_哭泣", `“好痛。。。好痛啊。。。”`],
        ["", `豆丁女呜咽着，哭喊着。`],
        ["人间入间", `“哦哦。。。这个好棒。。。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/BE2_2.jpg",
      texts: [
        ["", `鸡鸡酥酥麻麻的，虽然很怪，但又很舒服。前所未有的刺激感觉一阵阵的袭来，追寻着这快乐的我不断的扭动着腰。`],
        ["人间入间", `“嗯嗯。。。！”`],
        ["", `突然，感觉有几股热流从我的鸡鸡里涌了出来，随后，又从豆丁女的小缝缝里流了出来，是白白黏黏的液体。`],
        ["人间入间", `“哈啊。。哈啊。。。”`],
        ["", `心脏跳的好快。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/BE2_3.jpg",
      texts: [
        ["豆丁女_哭泣", `“已经。。。够了吧。。。求求你。。。放过我吧。。。我不会再来这里了，对不起，对不起。。。”`],
        ["", `豆丁女的眼神中失去了光辉。`],
        ["人间入间", `“啊啊。。。好——”`],
        ["", "嘭！"]
      ],
      effect: [{ pos: 3, kind: Effects.SHAKE}],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `一道强大的冲击从我头的右侧而来，那句好的还没来得及说出口，我就飞出了十几米远。强烈的眩晕感。。。这种感觉已经好几年没有了。`],
        ["豆丁女_哭泣", `“塞。。。塞巴斯！”`],
        ["", `模模糊糊的。。。这是豆丁女的声音。。。`],
        ["塞巴斯", `“抱歉，小姐，让您受惊了，这都是我的失职。请您闭上眼等一会，很快就会结束的。”`],
        ["", `结束？什么结束。。。`],
        ["人间入间", `“噗啊！”`],
        ["", `皮鞋重重的踩在了我的喉咙上，我感受到生命受到了威胁，用尽全力想把那只脚推开。`],
        ["", `然而。这份绝对的力量差距。注定了这一切。都是徒劳。`],
        ["塞巴斯", `“玷污大小姐的罪，就用你这条低贱的生命来偿还吧，乡巴佬。”`],
        ["人间入间", `哈。。。哈哈。。。
                这就是。。。我这条低贱的生命的结束了么。。。
                颈椎发出着清脆的声音。
                真是难看到好笑啊，哈哈哈哈哈哈！`],
        ["", `“咔嚓。”伴随着一声轻响，笑容，永远的留在了我的脸上。`],
      ],
      effect: [{ pos: 10, kind: Effects.SHAKE }],
    },
  ],
  prev: EternalCircleProgress.Act1After
}

const ACT1End: Scenario = {
  title: EternalCircleProgress.ACT1End,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/L.Z.一之宫.png",
      name: "L . Z . 一之宫"
    }, {
      avatar: "/assets/eternal-circle/chara/L.Z.一之宫.png",
      name: "豆丁女"
    }, {
      avatar: "/assets/eternal-circle/chara/人间.png",
      name: "人间入间"
    }, {
      avatar: "/assets/eternal-circle/chara/塞巴斯.png",
      name: "塞巴斯"
    },
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/河边.jpg",
      texts: [
        ["人间入间", `“一马平川的家伙。。。在说什么梦话呢。。。”`],
        ["豆丁女", `“预定是。。。要长很大的。”`],
        ["人间入间", `“你傻啊。。。”`],
        ["豆丁女", `“。。。”`],
        ["人间入间", `“。。。”`],
        ["", `两人相顾无言。突然，豆丁女伸出手指着我说道。`],
        ["豆丁女", `“我。。。认可你了，当我的。。。下仆吧。”`],
        ["人间入间", `“。。。那你可要给钱啊。”`],
        ["豆丁女", `“你怎么。。。这么没自尊啊。。。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/庭院.png",
      texts: [
        ["", `话虽如此，豆丁女还是把我带离了那个住所，并且真的给我发了钱，那是我之前无法想象的数额。之后她还很臭屁的玩了用钱扇脸的老套桥段。`],
        ["", `不久之后，我从管家的老爷爷处得知豆丁女本名是叫做 L.Z.一之宫，小我3岁，日英混血，是大贵族一之宫家的私生女。因为长的很可爱，没有被处理掉，而是悄悄的寄养到这边的偏僻小村软禁了起来。`],
        ["", `这家伙三餐吃的都是水果和蜜糖制成的特制菜单，荤腥不沾，怪不得比我还没力气了。`],
        ["人间入间", `“你这家伙的生活真是无忧无虑啊。”`],
        ["", `我对躺在庭院里的L说到。`],
        ["L . Z . 一之宫", `“无忧无虑。。。么。在你看来是这样的啊。”`],
        ["", `少女的瞳孔中倒映着无尽的天空。`],
        ["人间入间", `“不然你又有什么需要担心的么。”`],
        ["L . Z . 一之宫", `“是啊。。。你认为一个私生女被如此特别的方式供养着的目的是什么呢？”`],
        ["人间入间", `“。。。我也不知道你们城里人有什么玩法。”`],
        ["", `转回头时，我与那双大大的眼睛四目相对。`],
        ["L . Z . 一之宫", `“要我说，你才是真的无忧无虑啊。”`],
        ["人间入间", `“我们不是一个世界的人啊。”`],
        ["L . Z . 一之宫", `“不，我们是。”`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/黑市.jpg",
      texts: [
        ["", `在上流社会中，有相当一部分的人群对于成年女性没有兴趣。并不是说他们喜欢男人，他们中意的是尚未发育的少女。`],
        ["", `不要说大城市出身，教养良好的高级品，就连从乡村掠来的田舍娘在这样的人群中也能卖出我这样的底层平民难以想象的天价。`],
        ["", `而像L娘这样，有贵族血统，而且是用秘传的食谱养育出来的天生白发的混血幼女，其价值已经不是金钱能够衡量的了。这样的极品货色，不管是送给影响力巨大的政治家还是坐拥跨国家业的大商人，都是一份极其可观的筹码。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/庭院.png",
      texts: [
        ["L . Z . 一之宫", `“说白了就是会走路的超高级飞机杯啦。”`],
        ["", `柔弱的双唇间，流露出刺耳的话语。`],
        ["人间入间", `“。。。”`],
        ["L . Z . 一之宫", `“理解了么，我们都不是自由的活着的人啊。”`],
        ["", `“我。。。为之前说的话道歉。”`],
        ["", `“算啦算啦，我可不是为了听你道歉才告诉你这些的。”`],
        ["", `少女的瞳孔中又映照出蓝天。`],
        ["L . Z . 一之宫", `“不过啊，那次逃跑时能遇到你真是太好了。”`],
        ["人间入间", `“为什么这么说？”`],
        ["L . Z . 一之宫", `“这样一来我以后被那些猪头干的要失去意识的时候，想到自己有个两情相悦的男人就可以当成是绿帽Play了哦。”`],
        ["人间入间", `“你的荤段子一点都不好笑。。。”`],
        ["L . Z . 一之宫", `“哈哈哈哈哈哈！抱歉。”`],
        ["人间入间", `“。。。那个啊。”`],
        ["L . Z . 一之宫", `“恩？”`],
        ["人间入间", `“你不想。。。改变自己的命运么？比如。。。逃到别的地方去？”`],
        ["L . Z . 一之宫", `“逃到哪里呢？”`],
        ["人间入间", `“可以的，就像你改变了我的命运一样，我也能改变你的命运啊！”`],
        ["L . Z . 一之宫", `“别傻了。”`],
        ["", `少女话语中的情感瞬间凝结至冰点。`],
        ["L . Z . 一之宫", `“自己的生活都是别人施舍来的家伙乱说些什么大话啊。”`],
        ["人间入间", `“！我。。。”`],
        ["L . Z . 一之宫", `“够了，塞巴斯。”`],
        ["塞巴斯", `“是，小姐。”`],
        ["L . Z . 一之宫", `“把这家伙丢出去吧。”`],
        ["人间入间", `“？！”`],
        ["塞巴斯", `“遵命。”`],
        ["人间入间", `“老爷爷你！为什么！”`],
        ["塞巴斯", `“这是为了小姐，也是为了你好。”`],
        ["人间入间", `“你说什么啊！L她！这种事怎么会是为了她好？！”`],
        ["L . Z . 一之宫", `“不要再说了下仆。我现在已经在后悔了。”`],
        ["人间入间", `“难道你就没有抱有过一点点的希望么？”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `少女没有回过头来。`],
        ["L . Z . 一之宫", `“永别了。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/大门外.jpg",
      texts: [
        ["", `大门重重的关上了。`],
        ["人间入间", `“L。。。”`],
        ["", `夏日的灼风吹过大地，带走了叶尖最后一丝的水分。干黄的叶片缓缓飘下，落入了那曾经供养它长大的泥土之中。`],
        ["人间入间", `“我会改变给你看的，绝对。”`],
        ["", `人间入间14岁，为了生命中第一个真正所爱的人，开始了行动。`],
        ["", `残语：圆。`],
      ],
    },
  ],
  next: [{ text: "", result: EternalCircleProgress.Act2Start }]
}

const ACT2Pre: Scenario = {
  title: EternalCircleProgress.Act2Start,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/L.Z.一之宫.png",
      name: "L . Z . 一之宫"
    }, {
      avatar: "/assets/eternal-circle/chara/人间.png",
      name: "人间入间"
    }, {
      avatar: "/assets/eternal-circle/chara/塞巴斯.png",
      name: "塞巴斯"
    }, {
      avatar: "/assets/eternal-circle/chara/塞巴斯 (笑).png",
      name: "塞巴斯_微笑",
      display: "塞巴斯"
    },
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `第2章 火`],
        ["", `8月2日，我年满12岁的日子。<br>这一天是我们相遇的那天，也是我被要送到那个地方的日子。`],
      ],
      effect: [{ pos: 0, kind: Effects.TITLE }],
    },
    {
      bgImg: "/assets/eternal-circle/庭院.png",
      texts: [
        ["L . Z . 一之宫", `“还剩下。。。7天啊。”`],
        ["塞巴斯", `“不好意思，小姐，我们要走了。”`],
        ["L . Z . 一之宫", `“知道了。”`],
        ["", `乌云密布。`],
        ["L . Z . 一之宫", `“看这个样子是要有暴风雨了啊。”`],
        ["塞巴斯", `“快上车吧，小姐。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/车内.png",
      texts: [
        ["", `狂风呼啸。`],
        ["L . Z . 一之宫", `“真是。。。为什么一定要今天不可啊。”`],
        ["塞巴斯", `“您说的是，这么坏的天气要是发生事故的话就糟糕了。不过这个仪式是家主他坚持的，我们快去快回就是。`],
        ["L . Z . 一之宫", `“切。。。好吧。”`],
        ["塞巴斯", `“小姐，请不要把脚搭在座椅背上，也不要在车上把鞋子脱掉。”`],
        ["L . Z . 一之宫", `“别管那么多，专心开车。”`],
        ["塞巴斯", `“是，小姐。不过现在从后视镜里正好能看到您的内裤。”`],
        ["L . Z . 一之宫", `“。。。可恶的色老头。”`],
        ["", `L害羞的压住了裙子。`],
        ["塞巴斯", `“在业界这可是一种奖励哦，小姐。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/那一天.png",
      texts: [
        ["", `车子最后停在路边。`],
        ["塞巴斯", `“请抓住我的手，小姐。”`],
        ["L . Z . 一之宫", `“恩。”`],
        ["", `老人牵着少女的手，走在林间的小路上。如若是晴天，想必会是不错的景色吧，然而现在却是阴风怒号，日星隐耀，鸟兽哑声。`],
        ["L . Z . 一之宫", `（“这是有什么要来了。”）`],
        ["", `这样想着。`],
        ["", `一老一小走到了树下。老人停下脚步，向黑灰色的天空望去。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/野外.jpg",
      texts: [
        ["L . Z . 一之宫", `“怎么了？为什么突然停下来了啊。”`],
        ["", `L的声调中透露出一些不安。`],
        ["塞巴斯", `“虽然很突然，小姐。”`],
        ["", `老人缓缓转过身来。`],
        ["塞巴斯", `“按照预定，今天您要在这里死去。”`],
        ["L . Z . 一之宫", `“。。。你在说什么啊，这又是什么新的。。。”`],
        ["", `这当然不好笑，那个表情绝不是平常的塞巴斯。`],
        ["塞巴斯", `“字面上的意思哦，小姐。”`],
        ["", `老人走上前一步，少女亦向后退一步。`],
        ["塞巴斯", `“今天，您会死在这里。”`],
        ["L . Z . 一之宫", `“哼哼。。。我懂了。这就是那什么吧，恋尸癖什么的。”`],
        ["塞巴斯", `“小姐，您是从哪里学到那种词汇的？”`],
        ["L . Z . 一之宫", `“我。。。我说。。。你和我到底有什么恩怨啊。。。为什么我非得死不可啊。。。”`],
        ["塞巴斯", `“我想想啊。。。妻女全都被商业竞争的对手残酷的杀死，所以隐姓埋名潜伏到他身边伺机报复之类的？”`],
        ["L . Z . 一之宫", `“那种事和我没有关系吧！我只是个无辜12岁的幼女啊！”`],
        ["塞巴斯", `“是么，想必爱花她也曾经那样想过吧。”`],
        ["L . Z . 一之宫", `“啊呀！”`],
        ["", `少女后退时如俗套剧本一般摔倒。`],
        ["L . Z . 一之宫", `“呜呜。。。我。。。我什么都会做的。。。请不要杀我。。。求求你。。。”`],
        ["塞巴斯", `“好吧，那玩笑就开到这里。”`],
        ["L . Z . 一之宫", `“诶？”`],
        ["塞巴斯", `“不过您还是会死在这里。”`],
        ["L . Z . 一之宫", `“诶？”`],
        ["塞巴斯", `“小姐困惑的表情真是太可爱了。”`],
        ["L . Z . 一之宫", `“诶诶诶？”`],
        ["", `10分钟后，人间来到了约定好的地点。`],
        ["人间入间", `“L你咋搞成这样，屁股上全是泥。。。怎么还有股奇怪的味道？有点香香甜甜的。。。”`],
        ["L . Z . 一之宫", `“不要问，求你不要问了。”`],
        ["人间入间", `“额，那老爷爷的脸又是怎么回事？”`],
        ["塞巴斯", `“这是商业机密哦，少年。”`],
        ["人间入间", `“怎么搞的啊。。。”`],
        ["", `数分钟后。`],
        ["人间入间", `“也就是说，要用这具尸体，做出L不幸死掉的假象，尸体要伪造到现在的医学技术无法分辨真假的程度。”`],
        ["L . Z . 一之宫", `“说起来容易。。。真的做得到么？”`],
        ["人间入间", `“计划是这样的，这棵树上我已经事先插好了一些金属针，利用今天的雷暴天气，引导闪电劈中这棵树，引发森林大火，制造‘L烧焦的尸体’。”`],
        ["L . Z . 一之宫", `“真是大手笔的骗局啊。。。衣物和饮食要怎么伪造，还有牙齿的部分。。。”`],
        ["塞巴斯", `“除了衣物的部分，已经都准备妥当了，小姐。”`],
        ["L . Z . 一之宫", `“诶。”`],
        ["", `L娘本就白皙的皮肤更没有血色了。`],
        ["L . Z . 一之宫", `“。。。那么我就不深究如何伪造的了。。。衣物没有的话那就是说。。。”`],
        ["塞巴斯", `“是，这里是替换的衣物。”`],
        ["L . Z . 一之宫", `“。。。我知道了，做个临时更衣间吧，塞巴斯。”`],
        ["塞巴斯", `“是，这边请。”`],
        ["人间入间", `“那么麻烦干嘛，我又不会偷看。”`],
        ["L . Z . 一之宫", `“我再怎么说也是女孩子啊！”`],
        ["人间入间", `“明明还是平的要命。”`],
        ["L . Z . 一之宫", `“哈？！足足增加了有2厘米好么！你这呆子！”`],
        ["塞巴斯", `“小姐，再继续打情骂俏雷暴就要来了。”`],
        ["L . Z . 一之宫", `“我明明是受害者啊！”`],
        ["", `5分钟后。`],
        ["L . Z . 一之宫", `“换好了。。。这件衣服。。。之前从没见过。。。而且好扎身子啊。”`],
        ["塞巴斯", `“这是平常人家的少女衣物哦，小姐。还是尽早习惯比较好。”`],
        ["L . Z . 一之宫", `“呜呜。。。有必要把头发也剪到这么短么。。。”`],
        ["塞巴斯", `“当然。另外，小姐请把这些泥抹在脸上吧。”`],
        ["L . Z . 一之宫", `“好好好。。。我做就是了。。。”`],
        ["塞巴斯", `“恩恩，小姐很了不起呢。”`],
        ["L . Z . 一之宫", `“又把人当小孩子。。。”`],
        ["塞巴斯", `“在我看来小姐就算到死也只是个小孩子呢。”`],
        ["L . Z . 一之宫", `“咕。。。”`],
        ["塞巴斯", `“小姐，请看着我。”`],
        ["L . Z . 一之宫", `“嗯？”`],
        ["塞巴斯", `“你现在已经很困了，需要好好的睡上8个小时。”`],
        ["L . Z . 一之宫", `“？你在说什。。。么。。。”`],
        ["塞巴斯", `“晚安，小姐。”`],
        ["人间入间", `“恩？L她怎么睡着了？”`],
        ["塞巴斯", `“商业机密哦，少年。”`],
        ["", `L娘的脸上抹上了不少的泥，头发也剪成了短发，已经完全没有刚才见面时的大小姐样子了。`],
        ["人间入间", `“老爷爷你要怎么办，和我们一起走么。”`],
        ["塞巴斯", `“不错的提案啊，不过还是算了，我要在这里和小姐留在一起。”`],
        ["人间入间", `“！那是说？”`],
        ["塞巴斯", `“如果小姐都死掉了，同行的管家还活着的话未免会令人生疑吧。”`],
        ["人间入间", `“没必要做到这个地步吧！老爷爷你的妻子和女儿要怎么办？她们不是还等着你么？”`],
        ["塞巴斯", `“早就不在了哦。很久以前就。”`],
        ["人间入间", `“什么？！这。。。！那。。。那我之前交给您的那些钱。。。”`],
        ["塞巴斯", `“那些钱的话，全都帮您存起来了。”`],
        ["人间入间", `“。。。那您。。。到底是为了什么才帮我的？”`],
        ["塞巴斯", `“那不是你需要关心的了，少年。”`],
        ["", `管家把L娘放到了我的背上。`],
        ["塞巴斯", `“请您背好小姐，尽快离开吧。”`],
        ["人间入间", `“可。。。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/火.png",
      texts: [
        ["", `咔啦——！！！`],
        ["", `雷暴来临，第一道闪电便劈中了大树，树海转瞬之间便成了一片火海。`],
        ["塞巴斯", `“快走吧，少年。你还有着充满了光明的未来。”`],
        ["人间入间", `“。。。我知道了，我。。。一定会保护好L的。再次谢谢你，老爷爷。”`],
        ["塞巴斯", `“恩。去吧，记得看一下小姐左边的衣服口袋。”`],
        ["", `人间背着L娘，逆着风的方向跑了起来。`],
        ["塞巴斯", `“对，就是这样。”`],
      ],
      effect: [{ pos: 0, kind: Effects.FLASH}]
    },
    {
      bgImg: "/assets/eternal-circle/火中.png",
      texts: [
        ["", `管家面露微笑，向着火中走去。`],
        ["", `表界把买卖人口的事情暴露给了新皇，里界的交易也会因为这次的货物全部丢失而全面丧失可信度。。。想必会就此淡出权力层了吧。当主昏庸无道又树敌众多，一之宫家应该会就此没落了。`],
        ["塞巴斯_微笑", `烈火吞噬着衣装，夺去皮肤表层的水分。<br>从那之后已经三十年了啊，这样恩怨终于是了结了。`],
        ["塞巴斯_微笑", `连神经也烧焦了。<br>悠。`],
        ["塞巴斯_微笑", `连骨头也烧焦了。<br>爱花。`],
        ["塞巴斯_微笑", `连思考也烧焦了。<br>我来了。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/林中道.png",
      texts: [
        ["", `我背着L在森林中穿行，但是。。。这样扔下老爷爷他真的好么？`],
      ],
    }
  ],
  next: [
    {
      text: "折回。人人都有活下去的权利。",
      result: EternalCircleProgress.BE3,
    },
    {
      text: "不折回。我已经是个能独当一面的男子汉了，既然已经决定去做，那就不能去践踏塞巴斯的决心。",
      result: EternalCircleProgress.Act2After,
    }
  ]
}

const BE3: Scenario = {
  title: EternalCircleProgress.BE3,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/L.Z.一之宫.png",
      name: "L . Z . 一之宫"
    }, {
      avatar: "/assets/eternal-circle/chara/人间.png",
      name: "人间入间"
    }, {
      avatar: "/assets/eternal-circle/chara/nazoshinshi.jpg",
      name: "小弟1"
    }, {
      avatar: "/assets/eternal-circle/chara/nazoshinshi.jpg",
      name: "小弟2"
    }, {
      avatar: "/assets/eternal-circle/chara/nazoshinshi.jpg",
      name: "众小弟"
    }, {
      avatar: "/assets/eternal-circle/chara/佣兵队长.png",
      name: "部队队长"
    }, {
      avatar: "/assets/eternal-circle/chara/F酱.jpg",
      name: "扶她贵族"
    },
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/林中道.png",
      texts: [
        ["", `折回后数分钟。从刚才来的路上远远的望见有模糊的人影。`],
        ["人间入间", `“喂！谁在那！”`],
        ["", `人影好像停下了，做了些什么动作，然后就消失不见了。有点古怪，这不妙啊。。。<br>我放弃折回，加快脚步向山洞转移。然而。。。已经太晚了。`],
        ["", `噗通！`],
        ["人间入间", `“啊！”`],
        ["部队队长", `“这不是前几年被开除的那个孩子么。。。”`],
        ["", `一群带着古怪面具的人将我按倒在地，熟睡着的L也被他们掳走了。`],
        ["人间入间", `“放开我！我只是路过而已！”`],
        ["部队队长", `“少把人当傻子了，准备的这么充分还说什么路过，你在小瞧一之宫家的私人部队么？”`],
        ["人间入间", `私，私人部队？该死。。。还有这样的家伙在吗！`],
        ["小弟1", `“那么老大，咱们怎么办？就这么把蜂后送回去么？”`],
        ["部队队长", `“当然不。本来都想收队回去领钱解散了，没想到让我撞了个大运啊。”`],
        ["小弟1", `“诶？可是。。。”`],
        ["部队队长", `“现在的一之宫家可是捉襟见肘，树敌无数，把这个宝贝送回去也讨不到多少赏钱，说不定还得挨几个耳光。我的意思嘛，咱们不如来个李代桃僵。”`],
        ["小弟2", `“队长的意思是。。。”`],
        ["部队队长", `“这么一闹一之宫家也撑不了几天了，他们都已经准备的很完备了，过段日子咱们自己出手不就得了。。。不好卖的话让她自己去奥莉薇亚的店里拉客不是也行么？再不济。。。弟兄们也能用这上等的货好好爽爽。”`],
        ["众小弟", `“哦哦，队长真是高啊！”`],
        ["人间入间", `这些人渣。。。不行。。。我要好好想想。。。现在的我，现在的能做的到底是。。。！`],
        ["部队队长", `“啊，想到个好点子。”`],
        ["", `队长向我走过来。`],
        ["部队队长", `“辛苦了~接下来还得麻烦你当绑架犯咯。人间小朋友~”`],
      ],
      effect: [{ pos: 3, kind: Effects.SHAKE }]
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `几天后。人间入间，塞巴斯，还有L.Z.一之宫的尸体在森林中被发现。根据一之宫家私人部队的证言，数年前因个人问题被开除的人间因怀恨在心，一直在寻找机会实施报复，这次不幸被其得手，管家的老人和大小姐惨遭其毒手。
              在残忍的杀害了老人和少女后，凶手还侮辱了尸体，并且放火烧林打算毁尸灭迹，私人部队虽部署在附近，但无奈事情发生的过于突然，到达时虽已将凶手就地正法，但经过确认，受害者均已失去生命体征。`],
        ["", `“太可惜了，逝去的生命再也回不来了。”接受采访的佣兵A流着泪如是说。`],
        ["", `不久之后，一之宫家被新皇抄了家，家族所有的财产都被充公，一之宫本家还因贪污之罪遭夷灭三族。`],
        ["", `一之宫家垮台约一个月后，一名12岁的混血少女在黑市上卖出了天价。她曾是大户人家的私生女，以秘传的食谱养育而成，浑身散发奇香，据说连她的尿液都是甜的。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/可爱的小屋.png",
      texts: [
        ["", `某个夜。`],
        ["L . Z . 一之宫", `啊啊。 原谅我吧，人间。`],
        ["", `L躺在一张可爱的小床上，凝视着天花板。`],
        ["L . Z . 一之宫", `我已经。。。没法保持住自我了。。。`],
        ["", `一根有如少女手臂般粗细的粗壮男根在她的下体中抽插着，让小巧可爱的房间内回荡着色情的水声。`],
        ["扶她贵族", `“呼嘿~第七发也必须是结结实实的中出~！！这个小婊子，子宫口吸老子的龟头吸得好紧啊！想要怀孕到这种程度么？明明几个小时前还是处女，现在这败犬骚穴都会自己顺着肉棒缠上来了！这么喜欢老子我的大肉棒和精液吗？也不枉我花大价钱把你买下来了~”`],
        ["", `房间被精心布置过，如同社交网站上的网红照片中才能见到的女子小学生的闺房般可爱。萌萌的装饰物，软软的家具，家人的照片，在这里生活的一定是家里的小公主吧。要说有什么违和感的话，那就是有一个扶她在小床上把少女的下体侵犯到红肿，还没排卵过的子宫却几乎要脱垂出来的场景而已了。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/扶她CG.gif",
      texts: [
        ["", `最开始的时侯，少女还在大声的哭喊着，现在已经是什么反应都没有了。只有子宫口被龟头顶开的时候，身体才会脊髓反射的抽搐一下。`],
        ["扶她贵族", `“虽然当飞机杯也不错不过没有反应就不好玩了啊。。。夜还很漫长呢。。。 嘛，算了，这一针下去就让你爽到升天哦~”`],
        ["", `扶她贵族从桌上拿起一个针筒，吸满了粉色的液体。注射器刺破了颈部的皮肤，药物顺着血液渗透进了少女身体的每一个角落。`],
        ["L . Z . 一之宫", `啊啊。。。我知道这个。这是只在黑市上有卖的能杀死脑细胞的禁药。。。`],
        ["L . Z . 一之宫", `一之宫家的黑暗，私人部队的渣滓队长，塞巴斯。 人间入间。<br>明明。。。想要永远记住的。。。`],
        ["L . Z . 一之宫", `我爱你，人间。再见了，人间。我的唯一，我的初恋，我的。。。挚爱之人。如果。。。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `思考，在这一刻永远的停止了。`],
        ["", `那些不能忘记的记忆与残存的理性如玻璃碎片般崩溃，可怜的少女，从人类转职成为了高级的肉块。`],
        ["", `。。。<br>。。<br>。`],
      ],
    },
  ],
  prev: EternalCircleProgress.Act2Start
}


const ACT2After: Scenario = {
  title: EternalCircleProgress.Act2After,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/人间.png",
      name: "人间入间"
    }
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/林中道.png",
      texts: [
        ["人间入间", `我怎么能践踏老爷爷的决心！况且，一之宫家的势力或许也在附近，要是在这里被抓那就前功尽弃了！我放弃继续折回，加快脚步向山洞转移。`],
        ["", `在倾盆大雨的夜里，少年背着少女在林中艰难地行走着。漫漫长夜，没有人——甚至连人间自己——都不知道他是如何抵达山洞的。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `第二天早上，L在山洞中醒来了。我把所有的一切都告诉了她，L在我的怀里哭了整整两个小时。`],
        ["", `在L的情绪稳定下来后，我来到了附近的小镇上采购一些必需品。当天报纸的头条新闻，是一之宫家的私生女和管家不幸在一场森林大火中罹难的消息。因为之后下了大雨，受灾范围并没有进一步扩大，火也被浇灭了。
              在客栈住宿数日之后，听镇上的人说，一之宫家建在附近的宅子被新皇的士兵封锁了。又过了几天，报纸上刊登了一之宫的家主服毒自尽的消息，一之宫家早前因接受调查而冻结的数十亿不明资产也全都上缴国库了。
              一之宫家现在已是分崩离析，估计已经无力再深入追查一个私生女的下落了吧。
              依照老爷爷留在L娘衣服口袋中的纸条上记录的地址，我带着她踏上了旅途，离开了曾经供我们成长的这片土地，这片满含着悲伤，却又给予了希望的土地。
              七月末的火，将那棵大树烧尽了。在那场火被大雨浇灭后，那木炭中的养分又浸润回土壤之中，而新的种子，正在被燃烧殆尽的大地上萌芽。`],
        ["", `残语：之`],
      ],
    }
  ],
  next: [{ text: "", result: EternalCircleProgress.Act3 }]
}

const ACT3: Scenario = {
  title: EternalCircleProgress.Act3,
  narrators: [{
      avatar: "/assets/eternal-circle/chara/L.Z.一之宫.png",
      name: "L . Z . 一之宫"
    }, {
      avatar: "/assets/eternal-circle/chara/人间.png",
      name: "人间入间"
    }, {
      avatar: "/assets/eternal-circle/chara/nazoshinshi.jpg",
      name: "电视台消息"
    }, {
      avatar: "/assets/eternal-circle/chara/nazoshinshi.jpg",
      name: "电话"
    }, {
      avatar: "/assets/eternal-circle/chara/中年男人.jpg",
      name: "中年男人"
    },
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `第3章 异变`],
        ["", `离开故乡后，我和L隐藏身份已经在异国生活了整整五年了。`],
      ],
      effect: [{ pos: 0, kind: Effects.TITLE }],
    },
    {
      bgImg: "/assets/eternal-circle/客厅.png",
      texts: [
        ["人间入间", `“我说L啊。”`],
        ["L . Z . 一之宫", `“恩？”`],
        ["", `L躺在沙发上，一边吃着点心一边看着报纸。`],
        ["人间入间", `“给我坐好，还有不要在沙发上吃东西。”`],
        ["L . Z . 一之宫", `“这样比较舒服啊。”`],
        ["人间入间", `“今天打扫卫生的是我啊！”`],
        ["L . Z . 一之宫", `“切~亲亲我就起来。”`],
        ["人间入间", `“大早上的。。。好吧好吧。”`],
        ["", `明明都已经17岁了身心却都还是像小孩子一样。。。`],
        ["人间入间", `“唔姆。。。”`],
        ["", `还是一股香香甜甜的味道。`],
        ["L . Z . 一之宫", `“哈~好啦！充电完毕！”`],
        ["人间入间", `“我是电源么。”`],
        ["L . Z . 一之宫", `“不是哦，是只有我才能充的上的电！嘻嘻！”`],
        ["", `。。。该死，这个笑容真是。让我嘴角都上扬了。`],
        ["人间入间", `“啊。。对了，今天我会早点回来的。”`],
        ["L . Z . 一之宫", `“恩？怎么了？”`],
        ["人间入间", `“那啥。。。不是你生日嘛，今天。”`],
        ["L . Z . 一之宫", `“阿拉，我自己都差点忘了。”`],
        ["人间入间", `“你看，现在也有一些积蓄了，虽然只是一点点，今晚我们可以稍微奢侈一些哦。你有什么想吃的么？”`],
        ["L . Z . 一之宫", `“恩。。。帝王蟹？”`],
        ["人间入间", `“。。。所以说是一点点的程度啦，大小姐。”`],
        ["L . Z . 一之宫", `“那么就螃蟹味的好吃棒吧。”`],
        ["人间入间", `“上下限差距太过极限了吧！比这个再贪心一些也可以的！”`],
        ["L . Z . 一之宫", `“诶。。。就算你这么说。。。啊，不如这样吧，我们分别准备‘对方应该会喜欢的东西’，怎么样？”`],
        ["人间入间", `“听上去还挺有意思的。。。OK。”`],
        ["L . Z . 一之宫", `“哼哼，好好期待晚上吧。”`],
        ["人间入间", `“好好，那我上班去了，拜托你看家了，L。”`],
        ["L . Z . 一之宫", `“恩，路上小心。”`],
        ["人间入间", `“恩，我出门了。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/公司.png",
      texts: [
        ["人间入间", `鸡蛋，生姜，羊肉。。。原来如此。竟然有这样的做法啊。。。`],
        ["", `在利用午休时间翻看中式菜谱时我看到了一道有趣的菜肴，可以利用一些便宜的材料做出类似螃蟹的味道，真是不可思议。`],
        ["电视台消息", `“。。。被掠走的少女身份和劫犯的目的都还是未知数。。。”`],
        ["", `最近真是不太平啊，无差别袭击中小学生的法外狂徒，幸好L娘是不会出门。。。`],
        ["电视台消息", `“。。。根据目击者的证言，少女是白色短发的小学生，希望犯罪嫌疑人能早日落网，在此也提醒广大市民。。。”`],
        ["", `。。。应该不会吧。`],
        ["电话", `“嘟。。。嘟。。。嘟。。。嘟。。。”`],
        ["", `第三次拨通还是没有人接电话，我心中的不安已经满溢而出。我和主管打了声招呼就向家中赶了回去。`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/客厅.png",
      texts: [
        ["", `家中没有人在，但是门是锁好的。最好的可能是正好自己出门。。。最坏的可能就是。。。啧。<br>我又跑到了街上，要是昨天就把手机买好了。。。哪怕是个旧型号。。。`],
        ["电视台消息", `“。。。这是电视台刚收到的被劫走的少女的影像资料。。。”`],
        ["", `啊啊。。。为什么偏偏。。。<span style="color:red">最坏的可能。</span>`],
        ["", `一复一日，月复一月。一边更加努力工作攒钱，一边追寻着L娘的踪迹，下班后，休息日，警察也好，私家侦探也罢，即使是灯光也照不亮的黑暗中也完全没有任何的蛛丝马迹。L仿佛从没有在这个世界存在过一般，从我的身边永远的消失了。`],
        ["", `周五的晚上，回到住所时，门前放着一个匿名的包裹，里面装着一个接收装置一样的东西和一封信。`],
        ["", `“把电视连接上这个设备，明早8点时打开，调整接收频率到0.571024，不得报警，只要有人敲门，她就小命不保。”`],
        ["", `报警。。。对方的身份完全不知道，轻举妄动要是对方伤害了L的话。。。对方并没要求金钱之类的东西，也就是说目的是L本人或者是我么。。总之先把这录像模式打开，之后搜集线索吧。`],
        ["人间入间", `L。。。为什么。。。你总是要从我身边被夺去。。。`],
        ["", `第二天7点55分，我怀着忐忑的心情打开了电视的显示屏。目的是什么呢。。。还是说。。。`],
        ["", `8点整，信号接通了。<br>8点01分，理解了现实的我，跪倒在了显示屏前。`],
        ["人间入间", `啊啊。。。神啊。为什么你。。。`],
        ["中年男人", `“在看么？男友君噗？”`],
        ["人间入间", `<strong>总是要用如此的苦痛考验着人们？</strong>`],
      ]
    },
    {
      bgImg: "/assets/eternal-circle/猪男-白.jpg",
      texts: [
        ["中年男人", `“虽然经历了很多噗，但是属于本大爷的L娘，最后还是属于本大爷噗！那么！接下来就是万众期待已久的！破瓜环节噗！”`],
        ["L . Z . 一之宫", `“不要。。。不要碰我！不要！”`],
        ["中年男人", `“男友君有没有好好看着噗~快看，L娘的处女膜好漂亮噗，粉红色的噗！这可能是你第一次这么认真看吧噗。。。赶快好好的欣赏一下吧噗，因为它马上就要被本大爷的雄伟肉棒给捅破了噗~”`],
        ["", `为什么总是将如此的残酷惩罚降临于人们？`],
        ["L . Z . 一之宫", `“不要啊！我的处女是要留给人间。。。啊啊啊！”`],
        ["中年男人", `“本大爷的雄伟肉棒，刚刚贯穿了L娘的处女膜噗！处女膜的触感真是爽！太爽啦噗！而且破处后马上就完美的贴合上了肉棒噗，果然本大爷才是她真正命中注定的另一半噗！”`],
        ["L . Z . 一之宫", `“不要啊啊啊啊啊啊啊啊！”`],
        ["", `象征着L娘失去了纯洁的血液沿着那根肮脏的秽物缓缓的流下，留下一道樱色的痕迹。`],
        ["L . Z . 一之宫", `“呜。。。呜。。。好痛。。。好痛哦。。。”`],
        ["", `伴随着模糊的呜咽声，L娘娇小又脆弱的身体微微的颤抖着。`],
        ["人间入间", `“L。。。L啊啊啊。。。！”`],
        ["", `我用双拳重重的锤击着地板，无助的咆哮着。`],
        ["中年男人", `“那么本大爷要继续开动了噗。”`],
        ["L . Z . 一之宫", `“嗯啊？！”`],
        ["", `住手吧。。。`],
        ["中年男人", `“这就是L的小穴的触感么噗！太棒了噗！”`],
        ["", `求你了。。。住手吧。。。`],
        ["L . Z . 一之宫", `“恩恩？唔恩？!唔呕。。。”`],
        ["", `如猪一般的中年男子不断侵犯着L娘最重要的地方，那肮脏的男根也逐渐变得湿润起来。幼小的身体被过大的异物侵入，被粗暴的挤压着的内脏中，尚未消化完成的食物残渣从食道逆流而出。`],
        ["中年男人", `“好。。。好爽啊噗，不行了噗，要射了噗！”`],
        ["L . Z . 一之宫", `“唔等。。。等等！不要啊！快点拔出去！只有这个。。。只有这个不要啊嗯嗯嗯！”`],
        ["中年男人", `“抱歉噗~L娘的小穴太舒服了噗，除了射在里面没有其他的选择噗~”`],
        ["人间入间", `“。。。”`],
        ["", `我只是大张着嘴，喉咙却发不出任何声音。我将脸深深埋入地板，堵住耳朵。然而恶魔的耳语仍从指缝间不断的涌入。`],
        ["中年男人", `“看到了么男友君噗。。。L娘只是被本大爷中出而已就变成了这种表情噗。。。本大爷。。。才是L娘的真命天子噗。。。”`],
        ["人间入间", `。。。我要杀了你。。。`],
        ["L . Z . 一之宫", `“为。。。什么。。。库啊啊。。。啊啊啊！”`],
        ["中年男人", `“啊。。。啊嘞？为什么L娘你在哭噗？我知道了，是喜极而泣吧噗。那。。。那么为了保证确实的怀上可爱的小宝宝，我们来开始第二轮噗。”`],
        ["L . Z . 一之宫", `“不——”信号中断了。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["人间入间", `我现在就去杀你。猪男。`],
        ["", `黑色的瘴气充盈着我的周身，爬行类的鳞片从我的皮肤中生长出来，愤怒将我的理智全都吞噬殆尽，我怀着纯粹的杀意，向前迈出了一步。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/肮脏小屋.png",
      texts: [
        ["", `某间小公寓内。`],
        ["中年男人", `“啊嘞。。。怎么。。。进不去了噗。”`],
        ["", `中年男人因为不应期而无法勃起，焦急的搓动着肉棒。突然间，黑暗充满了小小的房间。`],
        ["中年男人", `“怎？怎么回事噗！这是什么噗！噗？！！！”`],
        ["", `虽然什么都看不到，但是这剧痛却是货真价实。`],
        ["中年男人", `“噗。。。噗噫。。。”`],
        ["", `鲜血从股间流下，极度强烈的痛觉渐渐蔓延开来。`],
        ["？？？", `“不会让你这么简单的死去的。。。畜生。。。”`],
        ["中年男人", `“噫。。。噫。。。你。。。你是。。。噗！！！”`],
        ["", `眼球被某种尖锐的东西戳爆了。`],
        ["中年男人", `“噫噫噫噫噫噗！啊啊啊啊噗！”`],
        ["人间入间", `“来吧，这是你自找的。就让我赐予你。。。无限的痛苦吧。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/肮脏小屋-血.jpg",
      texts: [
        ["", `数小时后。`],
        ["", `我恢复了意识，面前的猪男浑身是血，身体千疮百孔，已经完全没有了生命反应。而且。。。最令人作呕的是他伤口的周围都布满了缝合与恢复的痕迹，那些伤口如呼吸般扭动着，仿佛是独立于本体而存在着的生命。从猪男身体的孔洞中流出的血液和脂肪浸满了床单，在地板上形成一条肮脏的小溪。一股酸流涌了上来。`],
        ["人间入间", `“这。。。这是。。。”`],
        ["", `低下头时，一张放在盘中的纸映入了我的眼帘。我缓缓的打开了它，上面是L的字迹。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["字条", `“抱歉。”`],
        ["", `“如此肮脏的我，没有资格也没有勇气继续留在你的身边了。”`],
        ["", `“若不嫌弃，我房间的这个柜子里还有一笔小钱，那是我偷偷攒下，准备给你买礼物用的。”`],
        ["", `“希望你能尽快习惯没有我的生活，永别了。我的唯一，我的挚爱。”`],
        ["", `“L . Z . 人间上。”`],
        ["", `残语：共`],
      ],
    },
  ],
  next: [{ text: "", result: EternalCircleProgress.Act3_5 }]
}

const ACT3_5: Scenario = {
  title: EternalCircleProgress.Act3_5,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/人间.png",
      name: "人间入间"
    },
    {
      avatar: "/assets/eternal-circle/chara/L.Z.一之宫.png",
      name: "L . Z . 一之宫"
    }, {
      avatar: "/assets/eternal-circle/chara/nazoshinshi.jpg",
      name: "？？？"
    }
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `第3.5章 圆环的隙间`],
        ["", `猪男的死被判断为非人所作，现场虽然有我的存在，但是房间中和屋门上都没有留下我的指纹，而且也没有发现能造成那样伤势的凶器，在拘留了数日后，我被警方当做无关人士送回了住所。
而L自那之后却再无任何音讯。因为猎奇事件的发生，警力也完全放在了那上面。过了不久之后，除了L以外的所有失踪的少女陆续都被警方发现了。因为身体没有外伤也没有被侵犯的迹象，关于罪犯的信息完全不明，导致完全没有线索，最后整个事件只能被当做灵异事件看待而不了了之。郁郁寡欢的我染指了酒精，靠着失业保险金过着有一天没一天的日子。`],
        ["", `那一天，喝多了的我摸上了路边别人忘了锁门的小汽车，开到了不知道什么地方的乡下。意识朦朦胧胧的，中途听到了很响的砰的一声，以为是爆胎了的我下车检查时，却发现车后倒着一对年轻的夫妇。吓坏了的我赶紧回到车里，一刻不停的开回了城，把小汽车推进了河里就跑回了家，从此闭门不出了。`],
        ["", `一晃过了15年，我已经完全不是当年那个帅气的样子，在房间中从没出过门，三餐也吃的都是些垃圾食品，我越来越胖了。不知何时，我说话时还常常无法克制的会发出奇怪又可笑的声音。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/肮脏小屋.png",
      texts: [
        ["", `我到底做错了什么要过着这样的人生呢。。。就在我用最后的一点积蓄全都买了安眠药，打算自杀的那一天，一个巨大的包裹送到了我的房门前。`],
        ["", `没有寄件人，没有收件人，包装上什么装饰都没有。虽然我有一点点的怀疑，可当我打开包裹时，我瞬间就释然了。啊啊，你终于回到了我的身边。`],
        ["L . Z . 一之宫", `“你到底是什么东西啊？！你才不是人间！让我回去啊！”`],
        ["L . Z . 一之宫", `“咕啊。。。好痛。。。好痛。。。人。。。人间。。。救救。。我。。。”`],
        ["L . Z . 一之宫", `“不要。。。不要这样。。内裤。。。呜呜嗯。。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `为什么？为什么你在向殴打着你的人呼救呢？为什么？为什么要拒绝我呢？我们明明好不容易。。。才重新见面了——`],
        ["", `噗。<br>对了。。。我要向那个。。。把L娘变的奇怪的冒牌货。。。证明本大爷才是L娘真正的老公噗。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/研究室(黑).png",
      texts: [
        ["人间入间", "“好黑。。。好痛。。。这里是。。？”"],
        ["？？？", "“17点。。。第。。。结束。。。”"],
        ["人间入间", "“这声音是。。。我想起来了，我是。。。”"],
        ["", "重新构成中。。。"],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", "我从出生时起就是独自一人。父母在生下我后不久就不幸车祸去世，之后。。。"],
      ],
    },
  ],
  next: [{ text: "", result: EternalCircleProgress.Act4 }]
}

const ACT4: Scenario = {
  title: EternalCircleProgress.Act4,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/L.Z.一之宫.png",
      name: "L.Z . 一之宫"
    }, {
      avatar: "/assets/eternal-circle/chara/林檎.png",
      name: "林檎"
    }, {
      avatar: "/assets/eternal-circle/chara/路人.png",
      name: "路人"
    }, {
      avatar: "/assets/eternal-circle/chara/林檎妹妹.png",
      name: "林檎妹妹"
    },
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `第4章 实验室`],
      ],
      effect: [{ pos: 0, kind: Effects.TITLE }],
    },
    {
      bgImg: "/assets/eternal-circle/研究室.png",
      texts: [
        ["林檎", `“早上好，长官。”`],
        ["L.Z . 一之宫", `“唔恩，早上好。”`],
        ["", `我叫林檎，是个刚从士官学校毕业的新兵。眼前这个名叫L.Z . 一之宫的女性，是我目前的上司，辅助兵装开发科主任，开发出了帝国最尖端的辅助兵装——M.L.B.A，精神限制突破装置，使得帝国的生化人完全突破了心理层面的身体机能限制，在战争中大获全胜。因此巨大的功绩，她在男性主导的军队中爬到现在的地位，并且拥有着自己的专属研究室。然而，对外真实身份保密的这位才女，本人还是有些问题，那就是——`],
        ["L.Z . 一之宫", `“手上的动作慢下来了哦。”`],
        ["林檎", `“啊，不好意思。”`],
        ["", `从身材到长相都和小学生没什么差别。`],
        ["L.Z . 一之宫", `“17时05分，第1142次实验，本次尝试设置为生母未死亡。”`],
        ["L.Z . 一之宫", `“信号接收稳定，实验开始。”`],
        ["", `一之宫小姐在获得这个研究室后一直对这个男性重复着这个实验，使用操作梦境的技术刺激着这个男性的精神，在梦境中，男人一次次的重复着与一之宫小姐相遇，离别，重逢，生活，掠夺，死亡的轮回。每次梦境都在不断的提高着刺激程度，男人的遭遇也越来越离奇与凄惨。40年的时间，在梦境中仅仅需要数十分钟便可经历完整。但是，这个人到底是为什么不得不在这里不断体验着这样绝望的人生呢？`],
        ["林檎", `“一之宫长官，请问这个实验的最终目的是什么呢？”`],
        ["L.Z . 一之宫", `“这好像不是你需要关心的事情吧，士兵。”`],
        ["林檎", `“。。。抱歉，我只是好奇，另外也有点同情这个男人。”`],
        ["L.Z . 一之宫", `“。。。”`],
        ["", `沉默。呜哇。。。不会惹她生气了吧。`],
        ["", ``],
        ["L.Z . 一之宫", `“为了唤醒他。”`],
        ["林檎", `“什么？”`],
        ["L.Z . 一之宫", `“我说，目的是唤醒他。”`],
        ["林檎", `“。。。只是这样么？”`],
        ["L.Z . 一之宫", `“嗯。”`],
        ["林檎", `“哈。。。”`],
        ["", `这答案也太过简单了。。。`],
        ["林檎", `“17时47分，第1142次实验结束。”`],
        ["L.Z . 一之宫", `“辛苦了，把数据传输过来吧。”`],
        ["林檎", `“是。”`],
        ["", `这次，男人也没有醒过来。`],
        ["L.Z . 一之宫", `“波峰在这里啊。。。那下次在这里调整看看。。。”`],
        ["林檎", `“那个，长官！”`],
        ["L.Z . 一之宫", `“恩？”`],
        ["林檎", `“请问，为什么一定要用让这个男人做那样的梦的方式刺激他呢？是否还有其他的方法？”`],
        ["L.Z . 一之宫", `“。。。今天你话可真多啊。”`],
        ["林檎", `“抱歉，因为我已经在您手下工作超过一年了，我却连自己在做什么都还不知道。我认为提出合理的建议是作为一个忠诚的下属应该做的。”`],
        ["L.Z . 一之宫", `“这样啊，那明天你可以不用来了。”`],
        ["林檎", `“什？！”`],
        ["L.Z . 一之宫", `“没听见么？我说明天你可以不用来了。我不需要会质疑我想法的下属。”`],
        ["林檎", `“。。。是，长官。”`],
        ["", `真是祸从口出。。。可恶的萝莉老太婆，天天就知道穿着黑丝诱惑下属的臭婊子。。。等到以后哪天老子爬到你上面，一定要把你干的口水横流，直翻白眼。。。`],
        ["L.Z . 一之宫", `“。。。”`],
        ["", `然后在你的黑木耳小o。。。未开发小o里播种，怀上以后也要继续干！要中出到你小腹装满老子的精液鼓起来！怀上了以后也要继续干你！让你肚子里的孩子泡在我的精液里，让你在绝望中无限的高潮！对，就先穿上女仆装捆在椅子上。。。`],
        ["L.Z . 一之宫", `“我说你这家伙。”`],
        ["林檎", `“啊，是！长官！”`],
        ["L.Z . 一之宫", `“平时看着还蛮正经的，没想到会想着这种事情啊。”`],
        ["林檎", `“？？”`],
        ["L.Z . 一之宫", `“制造梦境是通过精神控制实现的。。。但是现在还并没有那样的机器。”`],
        ["", `喂喂喂。。。那就是说。。。`],
        ["L.Z . 一之宫", `“不错，是我通过‘能力’实现的。没想到我的属下竟然是个如此了不起的变态，这可是需要好好调教一番啊。”`],
        ["林檎", `“啊~噫——”`],
        ["", `一之宫的手上发出奇异的光芒，我的意识逐渐远去。撤回前言，这家伙不是才女，是‘那边世界’的怪物。`],
        ["林檎", `“唔。。。恩。。。”`],
        ["L.Z . 一之宫", `“哦，你醒啦，变态。”`],
        ["林檎", `“该死的老太婆。。。你对我做了什么。。。”`],
        ["", `啪！左脸被狠狠的抽了一个耳光。`],
        ["L.Z . 一之宫", `“请你放尊重点哦，不然你可会在爬到我上面之前就被军法处死呢。只是对你下了强烈暗示而已，一个小时以后你就能动了。”`],
        ["林檎", `“混。。。蛋。。。”`],
        ["L.Z . 一之宫", `“爬到我这个位置的可没有什么好人哦。那么。。。”`],
        ["", `一之宫解开我的军裤，把我的小伙伴暴露出来。`],
        ["", `“吼，刚才意淫的时候那么猛，结果下面只是个小孩子尺寸的垃圾啊。”`],
        ["林檎", `“住口。。。”`],
        ["L.Z . 一之宫", `“这样的东西怕是其他女人都没有见过吧，真是完美的垃圾处男啊，呼呼~”`],
        ["林檎", `“可。。。可恶。。。你这个臭婊子。。。我要——”`],
        ["L.Z . 一之宫", `“这种没用的玩意儿。。。要不直接剪掉算了~？”`],
        ["", `一之宫手里拿出了一个亮闪闪的东西。`],
        ["林檎", `“你。。。你要做什么。。。不要。。。对不起，我说对不起，喂，你想要什么。。。”`],
        ["L.Z . 一之宫", `“我不喜欢吵闹的孩子哦。”`],
        ["林檎", `“我知道了，我们。。。我们好好谈谈好么！冷静，冷静一下！”`],
        ["L.Z . 一之宫", `“不。要。”`],
        ["林檎", `“求求你，只有这个，只有这个！我还是处男啊！”`],
        ["L.Z . 一之宫", `“再见啦。”`],
        ["", `咔嚓。`],
        ["林檎", `“嘎啊啊啊啊呀呀呀呀呀啊啊啊啊！”`],
        ["L.Z . 一之宫", `“真是可爱啊。”`],
        ["林檎", `“啊。。？啊？”`],
        ["", `低头一看，小伙伴还在。`],
        ["L.Z . 一之宫", `“你这家伙的体质很容易受到暗示和催眠的影响啊，挺不错的。”`],
        ["林檎", `“。。。”`],
        ["L.Z . 一之宫", `“而且。。。还是个抖M啊。”`],
        ["", `我的小老弟竟然直挺挺的翘了起来，前端还挂着谜之液体。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/研究室足交.jpg",
      texts: [
        ["L.Z . 一之宫", `“你好像是。。喜欢我穿的这个，是吧？”`],
        ["", `一之宫的黑丝小脚在我眼前晃动着，包裹着美足的黑丝将女性的曲线美塑造至极致，并散发着诱人的荷尔蒙气息。我的小老弟伴随着晃动也一下一下的抖动着。`],
        ["L.Z . 一之宫", `“这样的抖M处男鸡鸡。。。就要这样！”`],
        ["林檎", `“噫咕——”`],
        ["", `我的小伙伴被一之宫的黑丝小脚一脚踩到实验室的地板上，并狠狠地摩擦。`],
        ["L.Z . 一之宫", `“喂喂，你这表情看起来可不太妙啊。难道说，你被这样对待了以后反而觉得很爽么？啊哈哈！真是要笑死我了啊，这个恶心鸡鸡，恶心！恶心的要吐了！”`],
        ["", `一之宫用全身的重量压在了我鸡鸡上面，并用比刚才更粗暴的方式摩擦，不，只是在单纯的践踏蹂躏而已。这使我发出痛苦的呻吟。这时，她把脸凑到了我的耳边，`],
        ["L.Z . 一之宫", `“你这头恶心的要死的垃圾处男M猪。”`],
        ["", `我浑身猛的颤抖。`],
        ["L.Z . 一之宫", `“呜哇。。。竟然射了？处男精液真是又脏又臭啊。。。你这是想让袜子怀孕么？”`],
        ["林檎", `“啊。。。啊。。。”`],
        ["", `似乎我内心深处有什么东西觉醒了。`],
        ["L.Z . 一之宫", `“诶~好像还硬着啊。那么这次就。。。”`],
        ["林檎", `“噫。。。噫。。。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/研究室裸足.png",
      texts: [
        ["", `刚刚射过还很敏感的龟头又被裸足温柔的包裹起来，缓缓的搓动着。粗糙的质感急切的催促着我的小老弟重新做好战斗准备，时而舒缓，时而加速，有时用足底按摩着龟头，有时用脚趾包住棒身。一之宫凭借着高超的足技肆意玩弄着我的分身，柔软的裸足的绝妙触感在我肉棒上游走，在无法预知的快感中我的小老弟一直保持着坚挺的状态，在我快要射出时，足交又马上停下，让我无法发泄出来，肉棒保持着这样充血的状态已经持续了将近1个小时，整个人都要疯掉了。`],
        ["L.Z . 一之宫", `“怎么样？还嘴硬么？”`],
        ["林檎", `“我%*&#@你……（￥~啊！”`],
        ["L.Z . 一之宫", `“被玩的时间太长连语言能力都失去了么。。。真是垃圾啊。。。那么。。。只要你说出‘我是一之宫大人的恶心种猪’我就让你射出来哦。”`],
        ["林檎", `“我是一之宫大人的恶心种猪！我是一之宫大人的恶心种猪！让我射精吧！让我射精吧！”`],
        ["L.Z . 一之宫", `“做的真好。。。那么。。。”`],
        ["林檎", `“啊呜恩噫啊啊啊?~”`],
        ["", `一之宫的小脚将我的肉棒踩到紧贴着肚子，脚趾勾起，快速摩擦蹂躏着我的肉棒。混合着痛楚却又无比强烈的快感将我最后一丝丝的理智完全吞噬殆尽，伴随着我已经不可名状的奇怪呻吟，我将我作为男性的尊严和精液全都射在了那恶魔般的足底之上。`],
        ["L.Z . 一之宫", `“呼呼~好大的量。。。虽然作为男人不行，但是作为种猪倒是很出色嘛。。。喂，快点舔干净，我们开始要下一轮了。”`],
        ["林檎", `“我是一之宫大人的恶心种猪。。。我是一之宫大人的恶心种猪。。。”`],
        ["L.Z . 一之宫", `“已经无法思考了么。。。嘛，算了。就这样继续吧。”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/黑丝的恐惧.jpg",
      texts: [
        ["", `一之宫重新穿上黑丝裤袜，被精液染白的黑丝，又覆盖了上来。`],
        ["", `直到暗示解除为止。。。不，暗示大概早就解除了吧，直到一之宫放我走之前，我被她持续的调教着，被她的黑丝小脚反复的虐待着。从那之后，我竟然对普通的play失去了兴趣，只有被一边辱骂着一边做着黑丝足交才能射精了。。。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/研究室.png",
      texts: [
        ["路人", `“早上好，长官。”`],
        ["L.Z . 一之宫", `“早上好。”`],
        ["路人", `“这是今天的预定，不知道。。。是否方便现在确认一下呢？”`],
        ["L.Z . 一之宫", `“当然，有何不便？”`],
        ["路人", `“失礼了，下面的这位是。。。”`],
        ["L.Z . 一之宫", `“不用在意，只是头家畜而已。”`],
        ["路人", `“了。。。解了，那么今天9点。。。”`],
        ["", `去抖M夜店的事情暴露后被老爸赶出了家门，在同期生中也因为变态性癖的传闻受到严重的排挤而被欺凌，失去了容身之处的我为了不被驱逐到贫民窟，只好厚着脸皮找到了一之宫，最后，我以“实验素材”的名义被留了下来。我作为人体椅子，屈辱的结束了自己的人生。。。`],
        ["", `。。。<br>。。。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["林檎妹妹", `“。。。起。。。”`],
        ["林檎妹妹", `“。。。起来。。。”`],
        ["林檎妹妹", `“快起来啦老哥！”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/林檎的房间.png",
      texts: [
        ["林檎", `“啊？”`],
        ["", `我睁开了双眼，眼前是上初中的妹妹。`],
        ["林檎", `“太好了。。。是梦啊。。。”`],
        ["林檎妹妹", `“说啥呢？”`],
        ["林檎", `“没有。。。做了个噩梦。”`],
        ["林檎妹妹", `“梦见什么了？看你浑身都是汗啊。”`],
        ["林檎", `“我梦见。。。是什么来着。。。”`],
        ["林檎妹妹", `“哈。。。没劲。。。恩？”`],
        ["林檎", `“啊。。。啊嘞？”`],
        ["", `我的视线转向下身。只是被妹妹的黑丝裤袜蹭了几下，我竟然。。。`],
        ["林檎妹妹", `“老哥。。。差劲。。。”`],
        ["林檎", `“生！生理反应啦！好了快点出去！”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/研究室.png",
      texts: [
        ["", `8时55分，第10次实验结束。统合之前的实验结果可以得出结论，藉由“梦境制造机具”直接参与其中而模拟出的超高实感的梦境，可以对现实中人的精神状态产生显著的影响。
故而我的实验方向并无举报中所言的问题，可以继续探索令真暗龙骑士-人间入间复醒的方法。根据其在遇到所爱之人被他人侵犯时显示出的异常大脑活动峰值，更加强烈的刺激一定能对其解除沉睡状态产生正面的影响。
如果能如同那一日压制一之宫家的私人军队时一般，向邻国展现其空前绝后的力量，帝国的伟业定能寿与天齐。无需更多的质疑，我必将证明自己研究的正确性。荣光为帝国而生。<br>——L . Z . 一之宫    20XX年Y月Z日上。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/轮回之路.jpg",
      texts: [
        ["", `二十年前，从鸟笼中逃出后没有多久，我们就遭遇了在附近待命的一之宫家的私人部队。在人间被打成重伤，我要被队长掳走的危急之时，人间觉醒为了真暗龙骑士，将除我以外在场的其他生物全部虐杀至死。
而我在那次事件中被龙骑的力量所影响，获得了无比强大的精神操作的力量，并且肉体永远的停止了成长。而人间，则从那天起沉睡至今。修改实验人员测定的能力判定报告，操作将军，大臣，宰相，甚至是皇帝的认知，
击败只存在于精神中的强敌，一步一步，直到获得现在的位置。这不是欺骗，这是一无所有的我们获得容身之处的必要手段。为了让你再度回到我的身边，我究竟还要从你身边被夺走多少次呢？人间入间——我最最珍视的人啊。
L.Z.一之宫，不，L.Z.人间，愿为你走尽这亘古无限的轮回之路，直到我们再会的那一天。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [
        ["", `。。。<br>。。。`],
        ["", `。。。`],
        ["", `世界的一切向着后方高速后退，所有的光在远方缩小成一个小小的点。`],
        ["", `死亡，沉默，希望，破坏，幸福，绝望；然后周而复始。`],
        ["", `世界的一切皆为你所得知，痛苦与悲伤，永无终结的绝对的轮回。`],
        ["", `这所有的一切，将在此时此刻，画上句点。`],
        ["", `残语：鸣`],
      ],
    },
  ],
  next: [{ text: "", result: EternalCircleProgress.ActEX }]
}

const ACTEX: Scenario = {
  title: EternalCircleProgress.ActEX,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/L.Z.一之宫.png",
      name: "L.Z . 一之宫"
    }, {
      avatar: "/assets/eternal-circle/chara/立华奏的粉丝.png",
      name: "立华奏的粉丝"
    }],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [["", `第Extra章 帝国之光`]],
      effect: [{ pos: 0, kind: Effects.TITLE }],
    },
    {
      bgImg: "/assets/eternal-circle/研究室.png",
      texts: [
        ["", `20XX年Y月Z日，今天一之宫那个家伙拿出了一天之内把巨乳控变成了黑丝控的实验结果，竟然让那些大人物信服了。。。我知道的，那家伙的实验。。。根本不是凭借什么机器完成的，而是靠自己精神控制的超能力！然而全帝国不会被她的精神操作能力影响的只有我一个人。。。我立华奏的粉丝，一定要扳倒那个魂淡豆丁，让她跪着舔我鞋底的狗屎！`],
        ["L.Z . 一之宫", `“啊啦，立华桑，辛苦了。”`],
        ["立华奏的粉丝", `“一一一一一一之宫！”`],
        ["", `这家伙什么时候出现在我身后的！不能大意啊，立华君！`],
        ["L.Z . 一之宫", `“您的反应为何如此激烈呢？我只是普通的问好一下而已哦。”`],
        ["立华奏的粉丝", `“哼。。。哼哼。。。你的计划我已经看透了！你这种靠着作弊上来的家伙，我迟早有一天要让你摔个狗啃屎！”`],
        ["L.Z . 一之宫", `“啊，是么。那么，我会期待着有那么一天的哦~再见啦，活在快乐中的立华桑。”`],
        ["立华奏的粉丝", `“你！你这家伙！又在看不起我！”`],
        ["L.Z . 一之宫", `“怎么会呢？立华奏三等研究员。”`],
        ["立华奏的粉丝", `“什么！你这！！！”`],
        ["", `作为维持这个庞大的精神控制的重要一环，依靠某些“认为自己没有被控制”的存在来发现并修正一些不够合理的地方来避免被过多的人发现，也是十分必要的呢。`],
        ["", `在曼妙的粗口声中，我向着前方，又迈出了一步。`],
      ],
    }
  ],
  next: [{ text: "", result: EternalCircleProgress.Act5 }]
}

const ACT5: Scenario = {
  title: EternalCircleProgress.Act5,
  narrators: [{
    avatar: "/assets/eternal-circle/chara/L娘.png",
    name: "L娘"
  }],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/black.jpg",
      texts: [["", `终章 终结的轮回`]],
      effect: [{ pos: 0, kind: Effects.TITLE }],
    },
    {
      bgImg: "/assets/eternal-circle/wooddoor.jpg",
      texts: [
        ["", `你被送回了这一切开始的地点。`],
        ["", `绅士之庭管理室前。`],
        ["", `你在异世界仿佛经历了无限漫长的时光，随着人间站长一次又一次的在轮回中穿梭。几乎快要迷失之时，是决心将你引回正途。`],
        ["", `只要打开这房门，破坏那轮回的根源，这场异变就会结束了。`],
        ["", `你转动门把手，打开了管理室的门。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["L娘", `“诶？你是。。。”`],
        ["", `你要做的是。。。`],
      ],
    },
  ],
  next: [
    { text: "将人间椅子踢倒", result: EternalCircleProgress.GE },
    { text: "将L娘的茶杯摔碎", result: EternalCircleProgress.BE4 },
    { text: "将火焰熄灭", result: EternalCircleProgress.BE5 },
    { text: "将电闸拉断", result: EternalCircleProgress.BE6 },
    { text: "将学姐摇醒", result: EternalCircleProgress.BE7 },
    { text: "将桃子淫“拯救”", result: EternalCircleProgress.RE },
  ]
}

const GE: Scenario = {
  title: EternalCircleProgress.GE,
  narrators: [
    {
      avatar: "/assets/eternal-circle/chara/人间入间.png",
      name: "人间入间"
    }, {
      avatar: "/assets/eternal-circle/chara/真诗君.png",
      name: "真诗君"
    }
  ],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["", `嘭！<br>你一脚踢了上去`],
        ["人间入间", `“哎呀！”`],
        ["", `人间站长被你踢倒在地。`],
        ["人间入间", `“放肆！死罪！虽然想这么说。。。”`],
        ["", `人间站长摸了摸头上的包。`],
        ["真诗君", `“多亏了你，这个停不下来的梦终于是结束了。”`],
        ["", `周围的一切先是渐渐变白，然后开始缓缓的崩溃，只剩下了你，人间站长和真诗君。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/white.png",
      texts: [
        ["人间入间", `“谢谢你，你拯救了绅士之庭。”`],
        ["", `“人间站长紧紧握住了你的手。`],
        ["人间入间", `我按照绅士之庭最高的荣誉赏赐你。”`],
        ["", `赋予你称号：轮回独断。`],
        ["真诗君", `“你所做的一切或许永远不会有人知晓。”`],
        ["", `真诗君拍着你的肩膀。`],
        ["真诗君", `“但是多亏了你，这个世界才得以继续前行。再次感谢你，无名的英雄。”`],
        ["", `你们三人的身体也开始崩溃。`],
        ["", `。。。<br>。。。`],
        ["", `。。。`],
        ["", `人间站长并非是制造了那个异世界的幕后黑手，仅仅是因为“圆”的共鸣而被异世界影响了。`],
        ["", `异世界的影响下的不协调的痕迹很快便消失殆尽，就连你自己也忘记了。`],
        ["", `唯一留下的只有一个你忘了怎么来的奇怪称号：`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/轮回独断.jpg",
      texts: [
        ["", `“轮回独断”。`],
      ],
    },
  ],
}

const BE4: Scenario = {
  title: EternalCircleProgress.BE4,
  narrators: [{
    avatar: "/assets/eternal-circle/chara/L娘.png",
    name: "L娘"
  }],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["", `啪啦！<br>你抓过L娘的茶杯扔到了地上。优雅的茶杯瞬间摔得粉碎。`],
        ["L娘", `“。。。你。。。都做了些什么？”`],
        ["", `不是这个！选错了！`],
        ["L娘", `“突然闯进来把我的茶杯给摔坏掉。。。那就代表你已经做好了被我玩弄到死为止的准备了，对吧？”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/white.png",
      texts: [
        ["", `你被L娘绑了起来，每天被抽100鞭子，弹蛋蛋100下，假阳具爆菊100次。`],
        ["", `三年后，你变秃了，也死了。`],
        ["", `在你死亡的同时。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["L娘", `“。。。你。。。都做了些什么？”`],
        ["", `你回到了摔碎茶杯的那一瞬间。`],
        ["", `你也被拖入了轮回之中了。并且是以最痛苦的方式。`],
      ],
    },
  ],
  prev: EternalCircleProgress.Act5
}

const BE5: Scenario = {
  title: EternalCircleProgress.BE5,
  narrators: [{
    avatar: "/assets/eternal-circle/chara/漫游火焰.jpg",
    name: "漫游火焰"
  }],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["", `你拿起管理室的灭火器，朝火焰喷了上去。`],
        ["漫游火焰", "。。。<small>。。。</small>..."],
        ["", `你感觉失去了什么。`],
        ["", `是。。。你的决心。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/white.png",
      texts: [
        ["", `原来火焰并未受到轮回的影响，但是他失去了语言能力，只能依靠燃烧热血作品维持自己的生命并给予他人走过轮回的决心。`],
        ["", `然而这一切现在被你破坏了，也再没有人有勇气走完这轮回。`],
        ["", `不过放心吧。`],
        ["", `没有人会指责你。`],
        ["", `因为很快，就不会有人知道要为何而指责你了。`],
      ],
    },
  ],
  prev: EternalCircleProgress.Act5
}

const BE6: Scenario = {
  title: EternalCircleProgress.BE6,
  narrators: [{
    avatar: "/assets/eternal-circle/chara/Duo.png",
    name: "Duo"
  }],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["", `你打开管理室的电箱，拉断了电闸。`],
        ["Duo", `“我草你妈！”`],
        ["", `地下室传来了Duo的咆哮。`],
        ["", `因为突然断电的缘故，服务器娘和站娘的能量核心受到严重损坏，双双猝死。`],
        ["", `愤怒的Duo冲了出来，一把抓住你的衣领。`],
        ["Duo", `“就是你丫的吧。。。拉电闸的混蛋。”`],
        ["", `你瑟瑟发抖，满口我不是我没有。`],
        ["Duo", `“甭害怕，我tm也不是好人。既然调教对象没有了。。。那就抓新的调教对象来就行了呗。”`],
      ],
      effect: [{pos:1, kind:Effects.SHAKE}],
    },
    {
      bgImg: "/assets/eternal-circle/DuoEND.png",
      texts: [
        ["", `之后，你被Duo进行了肉体改造，强行植入了能量核心。`],
        ["", `每天在高潮和失神中结束了余生。`],
      ],
    },
  ],
  prev: EternalCircleProgress.Act5
}

const BE7: Scenario = {
  title: EternalCircleProgress.BE7,
  narrators: [{
    avatar: "/assets/eternal-circle/chara/F酱.jpg",
    name: "F学姐"
  }],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["", `你用力的摇了摇F学姐。`],
        ["F学姐", `“唔。。嗯嗯？”`],
        ["", `F学姐睁开了眼。`],
        ["F学姐", `“早上。。。好~”`],
        ["", `但是还没睡醒的样子。`],
        ["F学姐", `“阿勒~仔细一看。。。你长得还蛮可爱的嘛。。。”`],
        ["", `娇小可爱的F学姐浮空了起来。`],
        ["", `胯间的凶器比你人还要大。`],
        ["", `原来刚刚F学姐睡的地方是她自己的扶她肉棒。。。wcnmb。`],
        ["F学姐", `“那么，就拜托你做清晨的侍奉咯~我再睡一会，哈~~~”`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/开腿.jpg",
      texts: [
        ["", `看不见的手将你抓起，你的大腿被强行分开。`],
        ["", `“啊啊啊，这怎么可能进得去啊啊啊！！！”你拼命的呼喊。`],
      ],
      effect: [{ pos: 1, kind: Effects.SHAKE }],
    },
    {
      bgImg: "/assets/eternal-circle/插入.jpg",
      texts: [
        ["", `下一瞬间，F学姐与你如字面意思般“紧密”的结合在了一起。`],
        ["", `你感觉自己的身体被逐渐撑开。。。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/white.png",
      texts: [
        ["", `可惜的是再下一瞬间时你的身体就变成了两半。你仿佛听见有人说道“劣质飞机杯”什么的，不过那已经和你没什么关系了。`],
      ],
    },
  ],
  prev: EternalCircleProgress.Act5
}

const RE: Scenario = {
  title: EternalCircleProgress.RE,
  narrators: [],
  dialogs: [
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["", `你向沙发走去。`],
        ["", `嗖！一把厨刀擦着头皮飞过，直直的插到了墙上。`],
      ],
    },
    {
      bgImg: "/assets/eternal-circle/榨精2.gif",
      texts: [
        ["", `克蕾儿酱的视线狠狠的注视着你，不过腰上的动作并没有停下。尽管你充满了决心，但此情此景还是让你后背发凉，你胆怯了。`],
        ["", `还是选择其他的看看吧。。。`],
      ],
      effect: [{ pos: 0, kind: Effects.CENTER_BG }, { pos: 1, kind: Effects.CENTER_BG }]
    },
    {
      bgImg: "/assets/eternal-circle/管理室.png",
      texts: [
        ["", `你要做的是。。。`],
      ],
    },
  ],
  next: [
    { text: "将人间椅子踢倒", result: EternalCircleProgress.GE },
    { text: "将L娘的茶杯摔碎", result: EternalCircleProgress.BE4 },
    { text: "将火焰熄灭", result: EternalCircleProgress.BE5 },
    { text: "将电闸拉断", result: EternalCircleProgress.BE6 },
    { text: "将学姐摇醒", result: EternalCircleProgress.BE7 },
  ]
}

export const Scenarios = [
  Prologue,
  ACT1Pre,
  ACT1After,
  ACT1End,
  ACT2Pre,
  ACT2After,
  ACT3,
  ACT3_5,
  ACT4,
  ACT5,
  ACTEX,
  GE,
  BE1,
  BE2,
  BE3,
  BE4,
  BE5,
  BE6,
  BE7,
  RE,
]
